/* automatically generated by rust-bindgen 0.72.1 */

pub type HighsInt = ::std::os::raw::c_int;
pub type HighsUInt = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HighsCallbackDataOut {
    pub cbdata: *mut ::std::os::raw::c_void,
    pub log_type: ::std::os::raw::c_int,
    pub running_time: f64,
    pub simplex_iteration_count: HighsInt,
    pub ipm_iteration_count: HighsInt,
    pub pdlp_iteration_count: HighsInt,
    pub objective_function_value: f64,
    pub mip_node_count: i64,
    pub mip_total_lp_iterations: i64,
    pub mip_primal_bound: f64,
    pub mip_dual_bound: f64,
    pub mip_gap: f64,
    pub mip_solution: *mut f64,
    pub mip_solution_size: HighsInt,
    pub cutpool_num_col: HighsInt,
    pub cutpool_num_cut: HighsInt,
    pub cutpool_num_nz: HighsInt,
    pub cutpool_start: *mut HighsInt,
    pub cutpool_index: *mut HighsInt,
    pub cutpool_value: *mut f64,
    pub cutpool_lower: *mut f64,
    pub cutpool_upper: *mut f64,
    pub external_solution_query_origin: HighsInt,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of HighsCallbackDataOut"][::std::mem::size_of::<HighsCallbackDataOut>() - 160usize];
    ["Alignment of HighsCallbackDataOut"][::std::mem::align_of::<HighsCallbackDataOut>() - 8usize];
    ["Offset of field: HighsCallbackDataOut::cbdata"]
        [::std::mem::offset_of!(HighsCallbackDataOut, cbdata) - 0usize];
    ["Offset of field: HighsCallbackDataOut::log_type"]
        [::std::mem::offset_of!(HighsCallbackDataOut, log_type) - 8usize];
    ["Offset of field: HighsCallbackDataOut::running_time"]
        [::std::mem::offset_of!(HighsCallbackDataOut, running_time) - 16usize];
    ["Offset of field: HighsCallbackDataOut::simplex_iteration_count"]
        [::std::mem::offset_of!(HighsCallbackDataOut, simplex_iteration_count) - 24usize];
    ["Offset of field: HighsCallbackDataOut::ipm_iteration_count"]
        [::std::mem::offset_of!(HighsCallbackDataOut, ipm_iteration_count) - 28usize];
    ["Offset of field: HighsCallbackDataOut::pdlp_iteration_count"]
        [::std::mem::offset_of!(HighsCallbackDataOut, pdlp_iteration_count) - 32usize];
    ["Offset of field: HighsCallbackDataOut::objective_function_value"]
        [::std::mem::offset_of!(HighsCallbackDataOut, objective_function_value) - 40usize];
    ["Offset of field: HighsCallbackDataOut::mip_node_count"]
        [::std::mem::offset_of!(HighsCallbackDataOut, mip_node_count) - 48usize];
    ["Offset of field: HighsCallbackDataOut::mip_total_lp_iterations"]
        [::std::mem::offset_of!(HighsCallbackDataOut, mip_total_lp_iterations) - 56usize];
    ["Offset of field: HighsCallbackDataOut::mip_primal_bound"]
        [::std::mem::offset_of!(HighsCallbackDataOut, mip_primal_bound) - 64usize];
    ["Offset of field: HighsCallbackDataOut::mip_dual_bound"]
        [::std::mem::offset_of!(HighsCallbackDataOut, mip_dual_bound) - 72usize];
    ["Offset of field: HighsCallbackDataOut::mip_gap"]
        [::std::mem::offset_of!(HighsCallbackDataOut, mip_gap) - 80usize];
    ["Offset of field: HighsCallbackDataOut::mip_solution"]
        [::std::mem::offset_of!(HighsCallbackDataOut, mip_solution) - 88usize];
    ["Offset of field: HighsCallbackDataOut::mip_solution_size"]
        [::std::mem::offset_of!(HighsCallbackDataOut, mip_solution_size) - 96usize];
    ["Offset of field: HighsCallbackDataOut::cutpool_num_col"]
        [::std::mem::offset_of!(HighsCallbackDataOut, cutpool_num_col) - 100usize];
    ["Offset of field: HighsCallbackDataOut::cutpool_num_cut"]
        [::std::mem::offset_of!(HighsCallbackDataOut, cutpool_num_cut) - 104usize];
    ["Offset of field: HighsCallbackDataOut::cutpool_num_nz"]
        [::std::mem::offset_of!(HighsCallbackDataOut, cutpool_num_nz) - 108usize];
    ["Offset of field: HighsCallbackDataOut::cutpool_start"]
        [::std::mem::offset_of!(HighsCallbackDataOut, cutpool_start) - 112usize];
    ["Offset of field: HighsCallbackDataOut::cutpool_index"]
        [::std::mem::offset_of!(HighsCallbackDataOut, cutpool_index) - 120usize];
    ["Offset of field: HighsCallbackDataOut::cutpool_value"]
        [::std::mem::offset_of!(HighsCallbackDataOut, cutpool_value) - 128usize];
    ["Offset of field: HighsCallbackDataOut::cutpool_lower"]
        [::std::mem::offset_of!(HighsCallbackDataOut, cutpool_lower) - 136usize];
    ["Offset of field: HighsCallbackDataOut::cutpool_upper"]
        [::std::mem::offset_of!(HighsCallbackDataOut, cutpool_upper) - 144usize];
    ["Offset of field: HighsCallbackDataOut::external_solution_query_origin"]
        [::std::mem::offset_of!(HighsCallbackDataOut, external_solution_query_origin) - 152usize];
};
impl Default for HighsCallbackDataOut {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HighsCallbackDataIn {
    pub user_interrupt: ::std::os::raw::c_int,
    pub user_solution: *mut f64,
    pub cbdata: *mut ::std::os::raw::c_void,
    pub user_has_solution: ::std::os::raw::c_int,
    pub user_solution_size: HighsInt,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of HighsCallbackDataIn"][::std::mem::size_of::<HighsCallbackDataIn>() - 32usize];
    ["Alignment of HighsCallbackDataIn"][::std::mem::align_of::<HighsCallbackDataIn>() - 8usize];
    ["Offset of field: HighsCallbackDataIn::user_interrupt"]
        [::std::mem::offset_of!(HighsCallbackDataIn, user_interrupt) - 0usize];
    ["Offset of field: HighsCallbackDataIn::user_solution"]
        [::std::mem::offset_of!(HighsCallbackDataIn, user_solution) - 8usize];
    ["Offset of field: HighsCallbackDataIn::cbdata"]
        [::std::mem::offset_of!(HighsCallbackDataIn, cbdata) - 16usize];
    ["Offset of field: HighsCallbackDataIn::user_has_solution"]
        [::std::mem::offset_of!(HighsCallbackDataIn, user_has_solution) - 24usize];
    ["Offset of field: HighsCallbackDataIn::user_solution_size"]
        [::std::mem::offset_of!(HighsCallbackDataIn, user_solution_size) - 28usize];
};
impl Default for HighsCallbackDataIn {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type HighsCCallbackType = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_char,
        arg3: *const HighsCallbackDataOut,
        arg4: *mut HighsCallbackDataIn,
        arg5: *mut ::std::os::raw::c_void,
    ),
>;
pub const kHighsMaximumStringLength: HighsInt = 512;
pub const kHighsStatusError: HighsInt = -1;
pub const kHighsStatusOk: HighsInt = 0;
pub const kHighsStatusWarning: HighsInt = 1;
pub const kHighsVarTypeContinuous: HighsInt = 0;
pub const kHighsVarTypeInteger: HighsInt = 1;
